Revit 2027 API
TransmissionData.GetAllExternalFileReferenceIds Method
 Gets the ids of all ExternalFileReferences.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<ElementId> GetAllExternalFileReferenceIds()
Public Function GetAllExternalFileReferenceIds As ICollection(Of ElementId)
public:
ICollection<ElementId^>^ GetAllExternalFileReferenceIds()
member GetAllExternalFileReferenceIds : unit -> ICollection<ElementId>
Return Value
ICollection<ElementId>
 The ids of all ExternalFileReferences.
See Also
Reference
TransmissionData Class
Autodesk.Revit.DB Namespace